docs/math530/KBe21math530retAxler5B13.tex
% Created 2021-09-11 Sat 09:36
% Intended LaTeX compiler: xelatex
\documentclass[letterpaper]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1in]{geometry}
\usepackage{fontspec}
\usepackage{indentfirst}
\setmainfont[ItalicFont = LiberationSans-Italic, BoldFont = LiberationSans-Bold, BoldItalicFont = LiberationSans-BoldItalic]{LiberationSans}
\newfontfamily\NHLight[ItalicFont = LiberationSansNarrow-Italic, BoldFont       = LiberationSansNarrow-Bold, BoldItalicFont = LiberationSansNarrow-BoldItalic]{LiberationSansNarrow}
\newcommand\textrmlf[1]{{\NHLight#1}}
\newcommand\textitlf[1]{{\NHLight\itshape#1}}
\let\textbflf\textrm
\newcommand\textulf[1]{{\NHLight\bfseries#1}}
\newcommand\textuitlf[1]{{\NHLight\bfseries\itshape#1}}
\usepackage{fancyhdr}
\pagestyle{fancy}
\usepackage{titlesec}
\usepackage{titling}
\makeatletter
\lhead{\textbf{\@title}}
\makeatother
\rhead{\textrmlf{Compiled} \today}
\lfoot{\theauthor\ \textbullet \ \textbf{2021-2022}}
\cfoot{}
\rfoot{\textrmlf{Page} \thepage}
\titleformat{\section} {\Large} {\textrmlf{\thesection} {|}} {0.3em} {\textbf}
\titleformat{\subsection} {\large} {\textrmlf{\thesubsection} {|}} {0.2em} {\textbf}
\titleformat{\subsubsection} {\large} {\textrmlf{\thesubsubsection} {|}} {0.1em} {\textbf}
\setlength{\parskip}{0.45em}
\renewcommand\maketitle{}
\author{Rohan Vanheusden, Evan Steirman, Albert Huang}
\date{\today}
\title{Axler 5.B exercise 13}
\hypersetup{
 pdfauthor={Rohan Vanheusden, Evan Steirman, Albert Huang},
 pdftitle={Axler 5.B exercise 13},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\section{Axler 5.B Exercise 13}
\label{sec:org6fed5b4}
\begin{quote}
Suppose \(W\) is a complex vector space and \(T \in  \mathcal{L} (W)\) has no eigenvalues. Prove that every subspace of \(W\) invariant under \(T\) is either \(\{0\}\) or infinite-dimensional.
\end{quote}
\section{Proof}
\label{sec:orga78463d}
5.21 states
\begin{quote}
Every operator on a finite-dimensional, nonzero, complex vector space has an eigenvalue.
\end{quote}
\(W\) is given as a complex vector space, so for \(T\) to have no eigenvalues, it must be zero or infinite-dimensional. If \(W\) is zero, then all subspaces must also be zero. Thus, only the infinite-dimensional case remains.

By definition (5.14), for all subspaces \(V\) of \(W\) invariant under \(T\), \(T\big|_V\) exists in \(\mathcal{L} (V)\).

Suppose for the sake of contradiction that \(V\) is nonzero and finite-dimensional. By 5.21, \(T\big|_V\) has an eigenvalue. Then, there exists some \(\lambda \in \mathbb{C}\) and some \(v \neq 0 \in V\) s.t.
\[\begin{aligned}
  T\big|_V(v) = \lambda v
  \end{aligned}\]
However, \(T\big|_V\) is defined by \(v \mapsto Tv\), which implies that
\[\begin{aligned}
  Tv = T\big|_V(v) = \lambda v
  \end{aligned}\]
for \(v \neq 0 \in W\), which makes \(\lambda\) an eigenvalue of \(T\). This contradicts \(T\) having no eigenvalues, so there must be no subspaces \(V\) invariant under \(T\) that are nonzero and finite-dimensional. Thus, all such subspaces must be \(0\) or infinite-dimensional. \hfill \blacksquare
\end{document}
